[net]
batch=1
subdivisions=1
max_batches=1
momentum=0.9
decay=0.00005
policy=poly
power=4
learning_rate=0.01
angle==1
hue==1
saturation=1
exposure=1
aspect=1
height=28
width=28
channels=1
quantization_type=1
start_check_point=0
end_check_point=0
input_scale=0.02555669
input_zeropoint=17
normalize_mean_0=0.1307
normalize_mean_1=0.1307
normalize_mean_2=0.1307
normalize_var_0=0.3081
normalize_var_1=0.3081
normalize_var_2=0.3081

[convolutional]
quantization_type=1
quantization_layer_scale=0.07467851787805557
quantization_layer_zeropoint=48
filters=32
size=3
pad=0
stride=1
activation=relu

[maxpool]
quantization_type=1
quantization_layer_scale=0.07467851787805557
quantization_layer_zeropoint=48
size=2
pad=0
stride=2

[convolutional]
quantization_type=1
quantization_layer_scale=0.11148739606142044
quantization_layer_zeropoint=57
filters=64
size=3
pad=0
stride=1
activation=relu

[connected]
quantization_type=1
quantization_layer_scale=0.21051372587680817
quantization_layer_zeropoint=60
output=128
activation=relu

[connected]
quantization_type=1
quantization_layer_scale=0.2318161129951477
quantization_layer_zeropoint=41
output=10
activation=relu

[softmax]
groups=1
quantization_type=1
