[net]
batch=1
subdivisions=1
height=32
width=32
channels=3
momentum=0.9
decay=0.00005
max_crop=28
quantization_type=1
start_check_point=9;
end_check_point=0;
input_scale=0.0374;
input_zeropoint=57;
normalize_mean_0=0.485;
normalize_mean_1=0.456;
normalize_mean_2=0.406;
normalize_var_0=0.229;
normalize_var_1=0.224;
normalize_var_2=0.225;
learning_rate=0.01
policy=poly
power=4
max_batches=1

angle=1
hue=1
saturation=1
exposure=1
aspect=1

[convolutional]
quantization_type=1
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
filters=64
size=7
stride=2
pad=3
activation=relu

[maxpool]
quantization_type=1
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
size=3
pad=1
stride=2

[convolutional]
quantization_type=1
quantization_layer_scale=0.0313
quantization_layer_zeropoint=0
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
quantization_type=1
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
filters=64
size=3
stride=1
pad=1
activation=relu

[shortcut]
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
quantization_type=1
from=-3

[convolutional]
quantization_type=1
quantization_layer_scale=0.0246
quantization_layer_zeropoint=0
filters=64
size=3
stride=1
pad=1
activation=relu

[convolutional]
quantization_type=1
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
filters=64
size=3
stride=1
pad=1
activation=relu

[shortcut]
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
quantization_type=1
from=-3

[convolutional]
quantization_type=1
quantization_layer_scale=0.0242
quantization_layer_zeropoint=0
filters=128
size=3
stride=2
pad=1
activation=relu

[convolutional]
quantization_type=1
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
filters=128
size=3
stride=1
pad=1
activation=relu

[shortcut]
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
quantization_type=1
from=-3

[convolutional]
quantization_type=1
quantization_layer_scale=0.0201
quantization_layer_zeropoint=0
filters=128
size=3
stride=1
pad=1
activation=relu

[convolutional]
quantization_type=1
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
filters=128
size=3
stride=1
pad=1
activation=relu

[shortcut]
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
quantization_type=1
from=-3

[convolutional]
quantization_type=1
quantization_layer_scale=0.0217
quantization_layer_zeropoint=0
filters=256
size=3
stride=2
pad=1
activation=relu

[convolutional]
quantization_type=1
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
filters=256
size=3
stride=1
pad=1
activation=relu

[shortcut]
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
quantization_type=1
from=-3

[convolutional]
quantization_type=1
quantization_layer_scale=0.0062
quantization_layer_zeropoint=0
filters=256
size=3
stride=1
pad=1
activation=relu

[convolutional]
quantization_type=1
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
filters=256
size=3
stride=1
pad=1
activation=relu

[shortcut]
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
quantization_type=1
from=-3

[convolutional]
quantization_type=1
quantization_layer_scale=0.0072
quantization_layer_zeropoint=0
filters=512
size=3
stride=2
pad=1
activation=relu

[convolutional]
quantization_type=1
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
filters=512
size=3
stride=1
pad=1
activation=relu

[shortcut]
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
quantization_type=1
from=-3

[convolutional]
quantization_type=1
quantization_layer_scale=0.0031
quantization_layer_zeropoint=0
filters=512
size=3
stride=1
pad=1
activation=relu

[convolutional]
quantization_type=1
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
filters=512
size=3
stride=1
pad=1
activation=relu

[shortcut]
quantization_layer_scale=0.0500
quantization_layer_zeropoint=0
quantization_type=1
from=-3

[connected]
quantization_type=1
quantization_layer_scale=0.2766161859035492
quantization_layer_zeropoint=0
output= 10
activation=relu



[softmax]
groups=1
quantization_type=1